({
	"paragraphs" : [
		{
			"sentences" : [
				"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction which has dominated the last decade of interface design.",
				"At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit.",
				"Systems exploring augmented reality and ubiquitous computing have begun to address this challenge.",
				"However, these efforts have often taken the form of exporting the GUI paradigm to more world-situated devices, falling short of much of the richness of physical-space interaction they seek to augment."
			],
			"patches" : [
				{
					"start" : 113,
					"end" : 169,
					"options" : [
						"At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit. Systems exploring augmented reality and ubiquitous computing have begun to address this challenge. However, these efforts have often taken the form of exporting the GUI paradigm to more world-situated devices, falling short of much of the richness of physical-space interaction they seek to augment.",
						"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction which has dominated the [[last decade of ]]interface design.",
						"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction which has dominated the last decade of interface design.\r\n\r\n\r\nit has dominated since decades"
					],
					"canCut" : true,
					"cutVotes" : 3,
					"numEditors" : 5,
					"numVoters" : 5
				},
				{
					"start" : 188,
					"end" : 349,
					"options" : [
						"However, it falls short in many respects, particularly in embracing the rich interface modalities between people and their physical environments.",
						"At the same time, the GUI approach falls short[[ in many respects]], particularly in embracing the rich interface modalities between people and the physical environments they inhabit.",
						"At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit.\r\n\r\nthe GUI  falls short in  embracing the  interface  between people and the physical environments",
						"At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments.",
						"At the same time, the GUI approach fails in embracing the interface modalities between people and their physical environments."
					],
					"canCut" : false,
					"cutVotes" : 1,
					"numEditors" : 7,
					"numVoters" : 5
				}
			]
		}
	]
})