({
	"paragraphs" : [
		{
			"sentences" : [
				"Panel: NoSQL in the Cloud\nBlah blah blah -- argument about whether there should be a standard \"nosql storage\" API to protect developers storing their stuff in proprietary services in the cloud.",
				"Probably unrealistic.",
				"To protect yourself, use an open software offering, and self-host or go with hosting solution that uses open offering."
			],
			"patches" : [
				{
					"start" : 27,
					"end" : 41,
					"options" : [
						"Panel: NoSQL in the Cloud\r\n-- argument about whether there should be a standard \"nosql storage\" API to protect developers storing their stuff in proprietary services in the cloud.",
						"Panel: NoSQL in the Cloud -- This is an argument about whether there should be a standard \"nosql storage\" API to protect developers storing their stuff in proprietary services in the cloud."
					],
					"reasons" : [
						"Blah blah blah is unnecessary.",
						"the expression blah blah blah does not make any sense",
						"Style is unprofessional for a serious or important topic"
					],
					"numVotes" : 5
				},
				{
					"start" : 95,
					"end" : 101,
					"options" : [
						"Panel: NoSQL in the Cloud\r\nBlah blah blah -- argument about whether there should be a standard \"NoSQL storage\" API to protect developers storing their stuff in proprietary services in the cloud."
					],
					"reasons" : [
						"It would be NoSQL",
						"This could be either a spelling or style error with \"nosql\".  It should be NoSQL."
					],
					"numVotes" : 5
				},
				{
					"start" : 196,
					"end" : 217,
					"options" : [
						"To protect yourself, use an open software offering, and self-host or go with hosting solution that uses open offering.",
						"contd with prev. sentence as \'which is\' probably unrealistic. To protect yourself, use an open software offering, and self-host or go with hosting solution that uses open offering."
					],
					"reasons" : [
						"Can be deleted.",
						"Incomplete sentence"
					],
					"numVotes" : 5
				},
				{
					"start" : 269,
					"end" : 274,
					"options" : [
						"To protect yourself, use an open software offering, self-host or go with hosting solution that uses open offering.",
						"To protect yourself, use an open software offering with self-host or go with hosting solution that uses open offering."
					],
					"reasons" : [
						"style error - \", and\" should be replaced with \"with\"",
						"unnecessary \"and\"",
						"No comma necesary"
					],
					"numVotes" : 5
				}
			]
		},
		{
			"sentences" : [
				"Interesting discussion on disaster recovery.",
				"Since you\'ve outsourced operations to the cloud, should you just trust the provider w/ diaster recovery.",
				"People kept talking about busses driving through datacenters or fires happening.",
				"What about the simpler problem: a developer drops your entire DB. Need to protect w/ backups no matter where you host."
			],
			"patches" : [
				{
					"start" : 130,
					"end" : 150,
					"options" : [
						"Since you\'ve outsourced operations to the cloud, should you just trust the provider with disaster recovery?"
					],
					"reasons" : [
						"w/ should be with, and disaster is misspelled.",
						"w/ is used instead of \'with\', spelling mistake in disaster"
					],
					"numVotes" : 6
				},
				{
					"start" : 178,
					"end" : 184,
					"options" : [
						"People kept talking about buses driving through data centers or fires happening."
					],
					"reasons" : [
						"It should be \"buses\"",
						"spelling",
						"Spelling."
					],
					"numVotes" : 5
				}
			]
		}
	]
})