({
	"paragraphs" : [
		{
			"sentences" : [
				"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction which has dominated the last decade of interface design.",
				"At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit.",
				"Systems exploring augmented reality and ubiquitous computing have begun to address this challenge.",
				"However, these efforts have often taken the form of exporting the GUI paradigm to more world-situated devices, falling short of much of the richness of physical-space interaction they seek to augment."
			],
			"patches" : [
				{
					"start" : 113,
					"end" : 169,
					"options" : [
						"The graphical user interface (GUI) has been a leader in the last decade of interface design.",
						"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction.",
						"The graphical user interface (GUI) has proven both a successful and durable model for human-computer interaction for the last decade .",
						"The decade of dominance of graphical user interface (GUI), has proven both a successful and durable model for human-computer interaction. At the same time, the GUI approach falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit. Systems exploring augmented reality and ubiquitous computing have begun to address this challenge. However, these efforts have often taken the form of exporting the GUI paradigm to more world-situated devices, falling short of much of the richness of physical-space interaction they seek to augment."
					],
					"canCut" : true,
					"cutVotes" : 4,
					"numEditors" : 7,
					"numVoters" : 5
				},
				{
					"start" : 188,
					"end" : 349,
					"options" : [
						"At the same time, the GUI approach falls in embracing the rich interface modalities between people and the physical environments they inhabit.",
						"At the same time, the GUI approach falls short in many respects.",
						"At the same time, the GUI approach lacks in certain areas, particularly in embracing the rich interface modalities between people and the environments they inhabit.",
						"At the same time, it falls short in many respects, particularly in embracing the rich interface modalities between people and the physical environments they inhabit."
					],
					"canCut" : true,
					"cutVotes" : 3,
					"numEditors" : 5,
					"numVoters" : 6
				}
			]
		}
	]
})